/*
 * @Author: 常培
 * @Date: 2019-08-24 19:13:39
 * @LastEditTime: 2019-08-24 19:19:22
 * @Description: config
 */
export default {
  target: [
    '0. 刷题',
    '1. CSS（CSS3，CSS盒模型，BFC，IFC，定位新特性，绝对居中）',
    '2. HTML渲染机制（DOM树的解析，重拍，重绘，双飞翼圣杯布局）',
    '3. DOM事件（零级事件，二级事件，事件委托，捕获冒泡，自定义事件）',
    '4. js的数据类型（基础类型，引用类型，es6新增数据类型，值传递，引用传递，堆栈）',
    '5. js变量相关（变量提升，作用域，作用域链）',
    '6. js引擎执行机制（事件队列，宏任务，微任务，异步）',
    '7. new本质（Obj.__proto__，Obj.__proto__.constructor，Fn.prototype）',
    '8. 原型链（原型链的查找，原型链的顶端）',
    '9. 继承（继承的实现有多少种）',
    '10. 对象的深拷贝（几种方法）',
    '11. 设计模式以及面向对象（简单的设计模式比如：工厂模式，单例模式，观察者模式）',
    '12. 上下文（this）',
    '13. Promise（源码，Async，Await）',
    '14. Proxy（作用）',
    '15. 前端缓存（强缓存，协商缓存）',
    '16. 网络通信（TCP三次握手和四次挥手，HTTP，WebSocket，请求头，响应头，跨域）',
    '17. 前端安全（XSS，CSRF）',
    '18. 算法（diff算法，做题）',
    '19. 工具类（Webpack机制，npm机制，用Webpack自己搭建一个es6编译环境包括热更新）',
    '20. 应用（防抖、节流、排序、去重，数组求交集）',
    '21. 框架类（vue源码，VUEX源码，jq源码）',
    '22. vue相关_ 为什么Array无法实现双向绑定',
    '23. vue相关_ $set的原理',
    '24. vue相关_ this的原理',
    '25. vue相关_ data为什么要在回调里return',
    '26. vue相关_ new Vue做了什么',
    '27. vue相关_ watch实现原理，watch性能',
    '28. vue相关_ for循环的key值',
    '29. vue相关_ 计算属性怎么实现的',
    '30. vue相关_ vue.use() 工作原理',
    '31. vue相关_ 组件之间传值',
    '32. vue相关_ vue是如何渲染生成DOM的vnode',
    '33. vue相关_ 深度理解 new vue()都发生了什么'
  ],
  plan: [
    '第1周 1，2，3',
    '第2周 3，4，5',
    '第3周 6，7，8',
    '第4周 6，7，8',
    '第5周 9，10',
    '第6周 9，10，11',
    '第7周 12',
    '第8周 13，14',
    '第9周 15，17',
    '第10周 16，17',
    '第11周 18',
    '第12周 19',
    '第13周 19，20',
    '第14周 21',
    '第15周 21',
    '第16周 21',
    '第17周 21',
    '第18周 21',
    '第19周以后 0'
  ],
  method: '学习方法：深入学习前端基础知识，查博客看视频做笔记，光学知识点很难抓住重点，要多刷面试题，可以一边刷一边学。（一定要做笔记，把学的东西记下来，因为你会忘的很快，记下来面试前过一遍）'
}